# SQL Operators

## Arithmetic Operators (+, -, *, /)
Perform mathematical calculations on numeric data.

In [ ]:
DROP TABLE PRODUCTS_OP;

In [ ]:
CREATE TABLE PRODUCTS_OP (
    ProductID NUMBER PRIMARY KEY,
    ProductName VARCHAR2(50),
    Price NUMBER,
    Quantity NUMBER
);

In [ ]:
DESC PRODUCTS_OP;

In [ ]:
INSERT ALL
  INTO PRODUCTS_OP VALUES (1, 'Laptop', 50000, 2)
  INTO PRODUCTS_OP VALUES (2, 'Mouse', 500, 10)
  INTO PRODUCTS_OP VALUES (3, 'Keyboard', 1500, 5)
SELECT * FROM dual;

In [ ]:
SELECT * FROM PRODUCTS_OP;

In [ ]:
SELECT ProductName, Price + Quantity AS AddResult FROM PRODUCTS_OP;

In [ ]:
SELECT ProductName, Price - Quantity AS SubResult FROM PRODUCTS_OP;

In [ ]:
SELECT ProductName, Price * Quantity AS TotalCost FROM PRODUCTS_OP;

In [ ]:
SELECT ProductName, Price / Quantity AS UnitDiv FROM PRODUCTS_OP;

### Invalid query (division by zero)

In [ ]:
SELECT Price / 0 FROM PRODUCTS_OP;

## Relational Operators (=, <, >, <=, >=, <>, !=)
Compare values to return TRUE/FALSE.

In [ ]:
DROP TABLE EMP_REL;

In [ ]:
CREATE TABLE EMP_REL (
    EmpID NUMBER PRIMARY KEY,
    EmpName VARCHAR2(50),
    Salary NUMBER
);

In [ ]:
DESC EMP_REL;

In [ ]:
INSERT ALL
  INTO EMP_REL VALUES (1, 'Arjun Sharma', 60000)
  INTO EMP_REL VALUES (2, 'Priya Nair', 45000)
  INTO EMP_REL VALUES (3, 'Ramesh Iyer', 70000)
SELECT * FROM dual;

In [ ]:
SELECT * FROM EMP_REL;

In [ ]:
SELECT * FROM EMP_REL WHERE Salary >= 50000;

In [ ]:
SELECT * FROM EMP_REL WHERE Salary <> 60000;

In [ ]:
SELECT * FROM EMP_REL WHERE Salary = 45000;

### Invalid query (datatype mismatch)

In [ ]:
SELECT * FROM EMP_REL WHERE Salary = 'ABC';

## Logical Operators (AND, OR, NOT)
Combine multiple conditions in WHERE clause.

In [ ]:
DROP TABLE CUST_LOGIC;

In [ ]:
CREATE TABLE CUST_LOGIC (
    CustomerID NUMBER PRIMARY KEY,
    CustomerName VARCHAR2(50),
    City VARCHAR2(50),
    Status VARCHAR2(20)
);

In [ ]:
DESC CUST_LOGIC;

In [ ]:
INSERT ALL
  INTO CUST_LOGIC VALUES (1, 'Arjun Sharma', 'Bengaluru', 'Active')
  INTO CUST_LOGIC VALUES (2, 'Priya Nair', 'Chennai', 'Inactive')
  INTO CUST_LOGIC VALUES (3, 'Ramesh Iyer', 'Hyderabad', 'Active')
  INTO CUST_LOGIC VALUES (4, 'Kavita Desai', 'Mumbai', 'Active')
SELECT * FROM dual;

In [ ]:
SELECT * FROM CUST_LOGIC;

In [ ]:
SELECT * FROM CUST_LOGIC WHERE City='Chennai' AND Status='Inactive';

In [ ]:
SELECT * FROM CUST_LOGIC WHERE City='Mumbai' OR City='Chennai';

In [ ]:
SELECT * FROM CUST_LOGIC WHERE NOT City='Delhi';

In [ ]:
SELECT * FROM CUST_LOGIC WHERE Status='Active' AND CustomerID > 1;

## Special Oracle Operators

### Concatenation Operator (||)

In [ ]:
SELECT CustomerName || ' from ' || City AS FullInfo FROM CUST_LOGIC;

In [ ]:
SELECT CustomerName || Status FROM CUST_LOGIC;

### IN Operator

In [ ]:
SELECT * FROM CUST_LOGIC WHERE City IN ('Mumbai','Chennai');

In [ ]:
SELECT * FROM CUST_LOGIC WHERE CustomerID IN (1,2,3);

### BETWEEN Operator

In [ ]:
SELECT * FROM EMP_REL WHERE Salary BETWEEN 45000 AND 70000;

### LIKE Operator

In [ ]:
SELECT * FROM CUST_LOGIC WHERE CustomerName LIKE 'A%';

In [ ]:
SELECT * FROM CUST_LOGIC WHERE CustomerName LIKE '%S';

### IS NULL Operator

In [ ]:
SELECT * FROM CUST_LOGIC WHERE Status IS NULL;

In [ ]:
SELECT * FROM CUST_LOGIC WHERE Status IS NOT NULL;

In [ ]:
SELECT * FROM CUST_LOGIC WHERE Status != NULL; -- No results

In [ ]:
SELECT * FROM EMP_REL WHERE Salary > ALL (SELECT Salary FROM EMP_REL WHERE EmpName='Priya Nair');

In [ ]:
SELECT * FROM EMP_REL WHERE Salary > ANY (SELECT Salary FROM EMP_REL);

### EXISTS Operator

In [ ]:
SELECT * FROM CUST_LOGIC c WHERE EXISTS (SELECT 1 FROM EMP_REL e WHERE e.EmpID = c.CustomerID);

## Cheat Sheet
| Operator Type | Symbols / Keywords | Example | Notes |
|---------------|--------------------|---------|-------|
| Arithmetic | +, -, *, / | `Price * Quantity` | Watch divide by zero |
| Relational | =, <, >, <=, >=, <>, != | `Salary >= 50000` | Datatype mismatch â†’ error |
| Logical | AND, OR, NOT | `City='Chennai' AND Status='Active'` | Combine conditions |
| Concatenation | `||` | `FirstName || ' ' || LastName` | Cast non-strings |
| IN | IN (...) | `City IN ('Mumbai','Chennai')` | Values must match datatype |
| BETWEEN | BETWEEN ... AND ... | `Salary BETWEEN 40k AND 60k` | Inclusive of bounds |
| LIKE | LIKE pattern | `Name LIKE 'A%'` | Supports % and _ wildcards |
| IS NULL | IS NULL / IS NOT NULL | `Email IS NULL` | `= NULL` is invalid |
| ANY / ALL | ANY, ALL | `Salary > ALL (subquery)` | Subquery must return comparable datatype |
| EXISTS | EXISTS (subquery) | `EXISTS (SELECT 1 ...)` | Checks for existence of rows |